arendst/Tasmota/lib/libesp32/lib_mail/src/wcs/esp8266/ESP_Mail_WCS.cpp
/*
  Customized version of WiFiClientSecure.cpp v1.0.1

  WiFiClientBearSSL- SSL client/server for esp8266 using BearSSL libraries
  - Mostly compatible with Arduino WiFi shield library and standard
    WiFiClient/ServerSecure (except for certificate handling).

  Copyright (c) 2018 Earle F. Philhower, III

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef ESP_Mail_WCS_CPP
#define ESP_Mail_WCS_CPP

#ifdef ESP8266

#define LWIP_INTERNAL

#include <list>
#include <errno.h>
#include <algorithm>

extern "C"
{
#include <osapi.h>
#include <ets_sys.h>
}
#include <debug.h>
#include <ESP8266WiFi.h>
#include <PolledTimeout.h>
#include <WiFiClient.h>
#include "ESP_Mail_WCS.h"
#include <StackThunk.h>
#include <lwip/opt.h>
#include <lwip/ip.h>
#include <lwip/tcp.h>
#include <lwip/inet.h>
#include <lwip/netif.h>
#include <include/ClientContext.h>
#ifdef ESP8266
  #include <c_types.h>
#endif
#include <coredecls.h>

#if !CORE_MOCK

// The BearSSL thunks in use for now
#define br_ssl_engine_recvapp_ack thunk_br_ssl_engine_recvapp_ack
#define br_ssl_engine_recvapp_buf thunk_br_ssl_engine_recvapp_buf
#define br_ssl_engine_recvrec_ack thunk_br_ssl_engine_recvrec_ack
#define br_ssl_engine_recvrec_buf thunk_br_ssl_engine_recvrec_buf
#define br_ssl_engine_sendapp_ack thunk_br_ssl_engine_sendapp_ack
#define br_ssl_engine_sendapp_buf thunk_br_ssl_engine_sendapp_buf
#define br_ssl_engine_sendrec_ack thunk_br_ssl_engine_sendrec_ack
#define br_ssl_engine_sendrec_buf thunk_br_ssl_engine_sendrec_buf

#endif

#ifdef DEBUG_ESP_SSL
#define DEBUG_BSSL(fmt, ...) DEBUG_ESP_PORT.printf_P((PGM_P)PSTR("BSSL:" fmt), ##__VA_ARGS__)
#else
#define DEBUG_BSSL(...)
#endif

namespace ESP_Mail
{

  void ESP_Mail_WCS::_clear()
  {
    // TLS handshake may take more than the 5 second default timeout
    _timeout = 15000;

    _sc = nullptr;
    _sc_svr = nullptr;
    _eng = nullptr;
    _x509_minimal = nullptr;
    _x509_insecure = nullptr;
    _x509_knownkey = nullptr;
    _iobuf_in = nullptr;
    _iobuf_out = nullptr;
    _now = 0; // You can override or ensure time() is correct w/configTime
    _ta = nullptr;
    setBufferSizes(16384, 512); // Minimum safe
    _handshake_done = false;
    _recvapp_buf = nullptr;
    _recvapp_len = 0;
    _oom_err = false;
    _session = nullptr;
    _cipher_list = nullptr;
    _cipher_cnt = 0;
  }

  void ESP_Mail_WCS::_clearAuthenticationSettings()
  {
    _use_insecure = false;
    _use_fingerprint = false;
    _use_self_signed = false;
    _knownkey = nullptr;
    _sk = nullptr;
    _ta = nullptr;
    _axtls_ta = nullptr;
    _axtls_chain = nullptr;
    _axtls_sk = nullptr;
  }

  ESP_Mail_WCS::ESP_Mail_WCS() : WiFiClient()
  {
    _clear();
    _clearAuthenticationSettings();
    _certStore = nullptr; // Don't want to remove cert store on a clear, should be long lived
    stack_thunk_add_ref();
  }

  ESP_Mail_WCS::ESP_Mail_WCS(const ESP_Mail_WCS &rhs) : WiFiClient(rhs)
  {
    *this = rhs;
    stack_thunk_add_ref();
  }

  ESP_Mail_WCS::~ESP_Mail_WCS()
  {
    if (_client)
    {
      _client->unref();
      _client = nullptr;
    }
    _cipher_list = nullptr; // std::shared will free if last reference
    _freeSSL();
    stack_thunk_del_ref();
    // Clean up any dangling axtls compat structures, if needed
    _axtls_ta = nullptr;
    _axtls_chain = nullptr;
    _axtls_sk = nullptr;
  }

  ESP_Mail_WCS::ESP_Mail_WCS(ClientContext *client,
                             const ESP_Mail_X509List *chain, const PrivateKey *sk,
                             int iobuf_in_size, int iobuf_out_size, const ESP_Mail_X509List *client_CA_ta)
  {
    _clear();
    _clearAuthenticationSettings();
    stack_thunk_add_ref();
    _iobuf_in_size = iobuf_in_size;
    _iobuf_out_size = iobuf_out_size;
    _client = client;
    _client->ref();
    if (!_connectSSLServerRSA(chain, sk, client_CA_ta))
    {
      _client->unref();
      _client = nullptr;
      _clear();
    }
  }

  ESP_Mail_WCS::ESP_Mail_WCS(ClientContext *client,
                             const ESP_Mail_X509List *chain,
                             unsigned cert_issuer_key_type, const PrivateKey *sk,
                             int iobuf_in_size, int iobuf_out_size, const ESP_Mail_X509List *client_CA_ta)
  {
    _clear();
    _clearAuthenticationSettings();
    stack_thunk_add_ref();
    _iobuf_in_size = iobuf_in_size;
    _iobuf_out_size = iobuf_out_size;
    _client = client;
    _client->ref();
    if (!_connectSSLServerEC(chain, cert_issuer_key_type, sk, client_CA_ta))
    {
      _client->unref();
      _client = nullptr;
      _clear();
    }
  }

  void ESP_Mail_WCS::setClientRSACert(const ESP_Mail_X509List *chain, const PrivateKey *sk)
  {
    _chain = chain;
    _sk = sk;
  }

  void ESP_Mail_WCS::setClientECCert(const ESP_Mail_X509List *chain,
                                     const PrivateKey *sk, unsigned allowed_usages, unsigned cert_issuer_key_type)
  {
    _chain = chain;
    _sk = sk;
    _allowed_usages = allowed_usages;
    _cert_issuer_key_type = cert_issuer_key_type;
  }

  void ESP_Mail_WCS::setBufferSizes(int recv, int xmit)
  {
    // Following constants taken from bearssl/src/ssl/ssl_engine.c (not exported unfortunately)
    const int MAX_OUT_OVERHEAD = 85;
    const int MAX_IN_OVERHEAD = 325;

    // The data buffers must be between 512B and 16KB
    recv = std::max(512, std::min(16384, recv));
    xmit = std::max(512, std::min(16384, xmit));

