arendst/Tasmota/lib/libesp32/lib_mail/src/wcs/esp8266/ESP_Mail_WCS.cpp
    // Add in overhead for SSL protocol
    recv += MAX_IN_OVERHEAD;
    xmit += MAX_OUT_OVERHEAD;
    _iobuf_in_size = recv;
    _iobuf_out_size = xmit;
  }

  bool ESP_Mail_WCS::stop(unsigned int maxWaitMs)
  {
    bool ret = WiFiClient::stop(maxWaitMs); // calls our virtual flush()
    // Only if we've already connected, store session params and clear the connection options
    if (_handshake_done)
    {
      if (_session)
      {
        br_ssl_engine_get_session_parameters(_eng, _session->getSession());
      }
    }
    _freeSSL();
    return ret;
  }

  bool ESP_Mail_WCS::flush(unsigned int maxWaitMs)
  {
    (void)_run_until(BR_SSL_SENDAPP);
    return WiFiClient::flush(maxWaitMs);
  }

  int ESP_Mail_WCS::connect(IPAddress ip, uint16_t port)
  {
    if (!WiFiClient::connect(ip, port))
    {
      return 0;
    }
    return _connectSSL(nullptr);
  }

  int ESP_Mail_WCS::connect(const char *name, uint16_t port)
  {
    IPAddress remote_addr;
    if (!WiFi.hostByName(name, remote_addr))
    {
      DEBUG_BSSL("connect: Name loopup failure\n");
      return 0;
    }
    if (!WiFiClient::connect(remote_addr, port))
    {
      DEBUG_BSSL("connect: Unable to connect TCP socket\n");
      return 0;
    }
    _host_name = name;
    if (!_secured)
      return true;
    return _connectSSL(name);
  }

  int ESP_Mail_WCS::connect(const String &host, uint16_t port)
  {
    return connect(host.c_str(), port);
  }

  void ESP_Mail_WCS::_freeSSL()
  {
    // These are smart pointers and will free if refcnt==0
    _sc = nullptr;
    _sc_svr = nullptr;
    _x509_minimal = nullptr;
    _x509_insecure = nullptr;
    _x509_knownkey = nullptr;
    _iobuf_in = nullptr;
    _iobuf_out = nullptr;
    // Reset non-allocated ptrs (pointing to bits potentially free'd above)
    _recvapp_buf = nullptr;
    _recvapp_len = 0;
    // This connection is toast
    _handshake_done = false;
    _timeout = 15000;
  }

  bool ESP_Mail_WCS::_clientConnected()
  {
    return (_client && _client->state() == ESTABLISHED);
  }

  uint8_t ESP_Mail_WCS::connected()
  {
    if (available() || (_clientConnected() && _handshake_done && (br_ssl_engine_current_state(_eng) != BR_SSL_CLOSED)))
    {
      return true;
    }
    return false;
  }

  size_t ESP_Mail_WCS::_write(const uint8_t *buf, size_t size, bool pmem)
  {
    size_t sent_bytes = 0;

    if (!connected() || !size || !_handshake_done)
    {
      return 0;
    }

    do
    {
      // Ensure we yield if we need multiple fragments to avoid WDT
      if (sent_bytes)
      {
        optimistic_yield(1000);
      }

      // Get BearSSL to a state where we can send
      if (_run_until(BR_SSL_SENDAPP) < 0)
      {
        break;
      }

      if (br_ssl_engine_current_state(_eng) & BR_SSL_SENDAPP)
      {
        size_t sendapp_len;
        unsigned char *sendapp_buf = br_ssl_engine_sendapp_buf(_eng, &sendapp_len);
        int to_send = size > sendapp_len ? sendapp_len : size;
        if (pmem)
        {
          memcpy_P(sendapp_buf, buf, to_send);
        }
        else
        {
          memcpy(sendapp_buf, buf, to_send);
        }
        br_ssl_engine_sendapp_ack(_eng, to_send);
        br_ssl_engine_flush(_eng, 0);
        flush();
        buf += to_send;
        sent_bytes += to_send;
        size -= to_send;
      }
      else
      {
        break;
      }
    } while (size);

    return sent_bytes;
  }

  size_t ESP_Mail_WCS::write(const uint8_t *buf, size_t size)
  {
    return _write(buf, size, false);
  }

  size_t ESP_Mail_WCS::write_P(PGM_P buf, size_t size)
  {
    return _write((const uint8_t *)buf, size, true);
  }

  // We have to manually read and send individual chunks.
  size_t ESP_Mail_WCS::write(Stream &stream)
  {
    size_t totalSent = 0;
    size_t countRead;
    size_t countSent;

    if (!connected() || !_handshake_done)
    {
      DEBUG_BSSL("write: Connect/handshake not completed yet\n");
      return 0;
    }

    do
    {
      uint8_t temp[256]; // Temporary chunk size same as ClientContext
      countSent = 0;
      countRead = stream.readBytes(temp, sizeof(temp));
      if (countRead)
      {
        countSent = _write((const uint8_t *)temp, countRead, true);
        totalSent += countSent;
      }
      yield(); // Feed the WDT
    } while ((countSent == countRead) && (countSent > 0));
    return totalSent;
  }

  int ESP_Mail_WCS::read(uint8_t *buf, size_t size)
  {
    if (!ctx_present() || !_handshake_done)
    {
      return -1;
    }

    int avail = available();
    bool conn = connected();
    if (!avail && conn)
    {
      return 0; // We're still connected, but nothing to read
    }
    if (!avail && !conn)
    {
      DEBUG_BSSL("read: Not connected, none left available\n");
      return -1;
    }

    if (avail)
    {
      // Take data from the recvapp buffer
      int to_copy = _recvapp_len < size ? _recvapp_len : size;
      memcpy(buf, _recvapp_buf, to_copy);
      br_ssl_engine_recvapp_ack(_eng, to_copy);
      _recvapp_buf = nullptr;
      _recvapp_len = 0;
      return to_copy;
    }

    if (!conn)
    {
      DEBUG_BSSL("read: Not connected\n");
      return -1;
    }
    return 0; // If we're connected, no error but no read.
  }

  int ESP_Mail_WCS::read()
  {
    uint8_t c;
    if (1 == read(&c, 1))
    {
      return c;
    }
    DEBUG_BSSL("read: failed\n");
    return -1;
  }

  int ESP_Mail_WCS::available()
  {
    if (_recvapp_buf)
    {
      return _recvapp_len; // Anything from last call?
    }
    _recvapp_buf = nullptr;
    _recvapp_len = 0;
    if (!ctx_present() || _run_until(BR_SSL_RECVAPP, false) < 0)
    {
      return 0;
    }
    int st = br_ssl_engine_current_state(_eng);
    if (st == BR_SSL_CLOSED)
    {
      return 0; // Nothing leftover, SSL is closed
    }
    if (st & BR_SSL_RECVAPP)
    {
      _recvapp_buf = br_ssl_engine_recvapp_buf(_eng, &_recvapp_len);
      return _recvapp_len;
    }

    return 0;
  }

  int ESP_Mail_WCS::peek()
  {
    if (!ctx_present() || !available())
    {
      DEBUG_BSSL("peek: Not connected, none left available\n");
      return -1;
    }
    if (_recvapp_buf && _recvapp_len)
    {
      return _recvapp_buf[0];
    }
    DEBUG_BSSL("peek: No data left\n");
    return -1;
  }

  size_t ESP_Mail_WCS::peekBytes(uint8_t *buffer, size_t length)
  {
    size_t to_copy = 0;
    if (!ctx_present())
    {
      DEBUG_BSSL("peekBytes: Not connected\n");
      return 0;
    }

