arendst/Tasmota/lib/libesp32/lib_mail/src/wcs/esp8266/ESP_Mail_WCS.cpp
    _startMillis = millis();
    while ((available() < (int)length) && ((millis() - _startMillis) < 5000))
    {
      yield();
    }

    to_copy = _recvapp_len < length ? _recvapp_len : length;
    memcpy(buffer, _recvapp_buf, to_copy);
    return to_copy;
  }

  /* --- Copied almost verbatim from BEARSSL SSL_IO.C ---
   Run the engine, until the specified target state is achieved, or
   an error occurs. The target state is SENDAPP, RECVAPP, or the
   combination of both (the combination matches either). When a match is
   achieved, this function returns 0. On error, it returns -1.
*/
  int ESP_Mail_WCS::_run_until(unsigned target, bool blocking)
  {
    if (!ctx_present())
    {
      DEBUG_BSSL("_run_until: Not connected\n");
      return -1;
    }

    esp8266::polledTimeout::oneShotMs loopTimeout(_timeout);

    for (int no_work = 0; blocking || no_work < 2;)
    {
      optimistic_yield(100);

      if (loopTimeout)
      {
        DEBUG_BSSL("_run_until: Timeout\n");
        return -1;
      }

      int state;
      state = br_ssl_engine_current_state(_eng);
      if (state & BR_SSL_CLOSED)
      {
        return -1;
      }

      if (!(_client->state() == ESTABLISHED) && !WiFiClient::available())
      {
        return (state & target) ? 0 : -1;
      }

      /*
       If there is some record data to send, do it. This takes
       precedence over everything else.
    */
      if (state & BR_SSL_SENDREC)
      {
        unsigned char *buf;
        size_t len;
        int wlen;
        size_t availForWrite;

        buf = br_ssl_engine_sendrec_buf(_eng, &len);
        availForWrite = WiFiClient::availableForWrite();

        if (!blocking && len > availForWrite)
        {
          /*
           writes on WiFiClient will block if len > availableForWrite()
           this is needed to prevent available() calls from blocking
           on dropped connections
        */
          len = availForWrite;
        }
        wlen = WiFiClient::write(buf, len);
        if (wlen <= 0)
        {
          /*
           If we received a close_notify and we
           still send something, then we have our
           own response close_notify to send, and
           the peer is allowed by RFC 5246 not to
           wait for it.
        */
          return -1;
        }
        if (wlen > 0)
        {
          br_ssl_engine_sendrec_ack(_eng, wlen);
        }
        no_work = 0;
        continue;
      }

      /*
       If we reached our target, then we are finished.
    */
      if (state & target)
      {
        return 0;
      }

      /*
       If some application data must be read, and we did not
       exit, then this means that we are trying to write data,
       and that's not possible until the application data is
       read. This may happen if using a shared in/out buffer,
       and the underlying protocol is not strictly half-duplex.
       This is unrecoverable here, so we report an error.
    */
      if (state & BR_SSL_RECVAPP)
      {
        DEBUG_BSSL("_run_until: Fatal protocol state\n");
        return -1;
      }

      /*
       If we reached that point, then either we are trying
       to read data and there is some, or the engine is stuck
       until a new record is obtained.
    */
      if (state & BR_SSL_RECVREC)
      {
        if (WiFiClient::available())
        {
          unsigned char *buf;
          size_t len;
          int rlen;

          buf = br_ssl_engine_recvrec_buf(_eng, &len);
          rlen = WiFiClient::read(buf, len);
          if (rlen < 0)
          {
            return -1;
          }
          if (rlen > 0)
          {
            br_ssl_engine_recvrec_ack(_eng, rlen);
          }
          no_work = 0;
          continue;
        }
      }

      /*
       We can reach that point if the target RECVAPP, and
       the state contains SENDAPP only. This may happen with
       a shared in/out buffer. In that case, we must flush
       the buffered data to "make room" for a new incoming
       record.
    */
      br_ssl_engine_flush(_eng, 0);

      no_work++; // We didn't actually advance here
    }
    // We only get here if we ran through the loop without getting anything done
    return -1;
  }

  bool ESP_Mail_WCS::_wait_for_handshake()
  {
    _handshake_done = false;
    while (!_handshake_done && _clientConnected())
    {
      int ret = _run_until(BR_SSL_SENDAPP);
      if (ret < 0)
      {
        DEBUG_BSSL("_wait_for_handshake: failed\n");
        break;
      }
      if (br_ssl_engine_current_state(_eng) & BR_SSL_SENDAPP)
      {
        _handshake_done = true;
      }
      optimistic_yield(1000);
    }
    return _handshake_done;
  }

  static uint8_t htoi(unsigned char c)
  {
    if (c >= '0' && c <= '9')
      return c - '0';
    else if (c >= 'A' && c <= 'F')
      return 10 + c - 'A';
    else if (c >= 'a' && c <= 'f')
      return 10 + c - 'a';
    else
      return 255;
  }

  // Set a fingerprint by parsing an ASCII string
  bool ESP_Mail_WCS::setFingerprint(const char *fpStr)
  {
    int idx = 0;
    uint8_t c, d;
    uint8_t fp[20];

    while (idx < 20)
    {
      c = pgm_read_byte(fpStr++);
      if (!c)
        break; // String ended, done processing
      d = pgm_read_byte(fpStr++);
      if (!d)
      {
        DEBUG_BSSL("setFingerprint: FP too short\n");
        return false; // Only half of the last hex digit, error
      }
      c = htoi(c);
      d = htoi(d);
      if ((c > 15) || (d > 15))
      {
        DEBUG_BSSL("setFingerprint: Invalid char\n");
        return false; // Error in one of the hex characters
      }
      fp[idx++] = (c << 4) | d;

      // Skip 0 or more spaces or colons
      while (pgm_read_byte(fpStr) && (pgm_read_byte(fpStr) == ' ' || pgm_read_byte(fpStr) == ':'))
      {
        fpStr++;
      }
    }
    if ((idx != 20) || pgm_read_byte(fpStr))
    {
      DEBUG_BSSL("setFingerprint: Garbage at end of fp\n");
      return false; // Garbage at EOL or we didn't have enough hex digits
    }
    return setFingerprint(fp);
  }

  extern "C"
  {

    // BearSSL doesn't define a true insecure decoder, so we make one ourselves
    // from the simple parser.  It generates the issuer and subject hashes and
    // the SHA1 fingerprint, only one (or none!) of which will be used to
    // "verify" the certificate.

    // Private x509 decoder state
    struct br_x509_insecure_context
    {
      const br_x509_class *vtable;
      bool done_cert;
      const uint8_t *match_fingerprint;
      br_sha1_context sha1_cert;
      bool allow_self_signed;
      br_sha256_context sha256_subject;
      br_sha256_context sha256_issuer;
      br_x509_decoder_context ctx;
    };

    // Callback for the x509_minimal subject DN
    static void insecure_subject_dn_append(void *ctx, const void *buf, size_t len)
    {
      br_x509_insecure_context *xc = (br_x509_insecure_context *)ctx;
      br_sha256_update(&xc->sha256_subject, buf, len);
    }

