arendst/Tasmota/lib/libesp32/lib_mail/src/wcs/esp8266/ESP_Mail_WCS.cpp
    // Callback for the x509_minimal issuer DN
    static void insecure_issuer_dn_append(void *ctx, const void *buf, size_t len)
    {
      br_x509_insecure_context *xc = (br_x509_insecure_context *)ctx;
      br_sha256_update(&xc->sha256_issuer, buf, len);
    }

    // Callback on the first byte of any certificate
    static void insecure_start_chain(const br_x509_class **ctx, const char *server_name)
    {
      br_x509_insecure_context *xc = (br_x509_insecure_context *)ctx;
      br_x509_decoder_init(&xc->ctx, insecure_subject_dn_append, xc, insecure_issuer_dn_append, xc);
      xc->done_cert = false;
      br_sha1_init(&xc->sha1_cert);
      br_sha256_init(&xc->sha256_subject);
      br_sha256_init(&xc->sha256_issuer);
      (void)server_name;
    }

    // Callback for each certificate present in the chain (but only operates
    // on the first one by design).
    static void insecure_start_cert(const br_x509_class **ctx, uint32_t length)
    {
      (void)ctx;
      (void)length;
    }

    // Callback for each byte stream in the chain.  Only process first cert.
    static void insecure_append(const br_x509_class **ctx, const unsigned char *buf, size_t len)
    {
      br_x509_insecure_context *xc = (br_x509_insecure_context *)ctx;
      // Don't process anything but the first certificate in the chain
      if (!xc->done_cert)
      {
        br_sha1_update(&xc->sha1_cert, buf, len);
        br_x509_decoder_push(&xc->ctx, (const void *)buf, len);
#ifdef DEBUG_ESP_SSL
        DEBUG_BSSL("CERT: ");
        for (size_t i = 0; i < len; i++)
        {
          DEBUG_ESP_PORT.printf_P(PSTR("%02x "), buf[i] & 0xff);
        }
        DEBUG_ESP_PORT.printf_P(PSTR("\n"));
#endif
      }
    }

    // Callback on individual cert end.
    static void insecure_end_cert(const br_x509_class **ctx)
    {
      br_x509_insecure_context *xc = (br_x509_insecure_context *)ctx;
      xc->done_cert = true;
    }

    // Callback when complete chain has been parsed.
    // Return 0 on validation success, !0 on validation error
    static unsigned insecure_end_chain(const br_x509_class **ctx)
    {
      const br_x509_insecure_context *xc = (const br_x509_insecure_context *)ctx;
      if (!xc->done_cert)
      {
        DEBUG_BSSL("insecure_end_chain: No cert seen\n");
        return 1; // error
      }

      // Handle SHA1 fingerprint matching
      char res[20];
      br_sha1_out(&xc->sha1_cert, res);
      if (xc->match_fingerprint && memcmp(res, xc->match_fingerprint, sizeof(res)))
      {
#ifdef DEBUG_ESP_SSL
        DEBUG_BSSL("insecure_end_chain: Received cert FP doesn't match\n");
        char buff[3 * sizeof(res) + 1]; // 3 chars per byte XX_, and null
        buff[0] = 0;
        for (size_t i = 0; i < sizeof(res); i++)
        {
          char hex[4]; // XX_\0
          snprintf(hex, sizeof(hex), "%02x ", xc->match_fingerprint[i] & 0xff);
          strlcat(buff, hex, sizeof(buff));
        }
        DEBUG_BSSL("insecure_end_chain: expected %s\n", buff);
        buff[0] = 0;
        for (size_t i = 0; i < sizeof(res); i++)
        {
          char hex[4]; // XX_\0
          snprintf(hex, sizeof(hex), "%02x ", res[i] & 0xff);
          strlcat(buff, hex, sizeof(buff));
        }
        DEBUG_BSSL("insecure_end_chain: received %s\n", buff);
#endif
        return BR_ERR_X509_NOT_TRUSTED;
      }

      // Handle self-signer certificate acceptance
      char res_issuer[32];
      char res_subject[32];
      br_sha256_out(&xc->sha256_issuer, res_issuer);
      br_sha256_out(&xc->sha256_subject, res_subject);
      if (xc->allow_self_signed && memcmp(res_subject, res_issuer, sizeof(res_issuer)))
      {
        DEBUG_BSSL("insecure_end_chain: Didn't get self-signed cert\n");
        return BR_ERR_X509_NOT_TRUSTED;
      }

      // Default (no validation at all) or no errors in prior checks = success.
      return 0;
    }

    // Return the public key from the validator (set by x509_minimal)
    static const br_x509_pkey *insecure_get_pkey(const br_x509_class *const *ctx, unsigned *usages)
    {
      const br_x509_insecure_context *xc = (const br_x509_insecure_context *)ctx;
      if (usages != NULL)
      {
        *usages = BR_KEYTYPE_KEYX | BR_KEYTYPE_SIGN; // I said we were insecure!
      }
      return &xc->ctx.pkey;
    }

    //  Set up the x509 insecure data structures for BearSSL core to use.
    void esp_mail_br_x509_insecure_init(br_x509_insecure_context *ctx, int _use_fingerprint, const uint8_t _fingerprint[20], int _allow_self_signed)
    {
      static const br_x509_class br_x509_insecure_vtable PROGMEM = {
          sizeof(br_x509_insecure_context),
          insecure_start_chain,
          insecure_start_cert,
          insecure_append,
          insecure_end_cert,
          insecure_end_chain,
          insecure_get_pkey};

      memset(ctx, 0, sizeof *ctx);
      ctx->vtable = &br_x509_insecure_vtable;
      ctx->done_cert = false;
      ctx->match_fingerprint = _use_fingerprint ? _fingerprint : nullptr;
      ctx->allow_self_signed = _allow_self_signed ? 1 : 0;
    }

    // Some constants uses to init the server/client contexts
    // Note that suites_P needs to be copied to RAM before use w/BearSSL!
    // List copied verbatim from BearSSL/ssl_client_full.c
    /*
   * The "full" profile supports all implemented cipher suites.
   *
   * Rationale for suite order, from most important to least
   * important rule:
   *
   * -- Don't use 3DES if AES or ChaCha20 is available.
   * -- Try to have Forward Secrecy (ECDHE suite) if possible.
   * -- When not using Forward Secrecy, ECDH key exchange is
   *    better than RSA key exchange (slightly more expensive on the
   *    client, but much cheaper on the server, and it implies smaller
   *    messages).
   * -- ChaCha20+Poly1305 is better than AES/GCM (faster, smaller code).
   * -- GCM is better than CCM and CBC. CCM is better than CBC.
   * -- CCM is preferable over CCM_8 (with CCM_8, forgeries may succeed
   *    with probability 2^(-64)).
   * -- AES-128 is preferred over AES-256 (AES-128 is already
   *    strong enough, and AES-256 is 40% more expensive).
   */
    static const uint16_t suites_P[] PROGMEM = {
#ifndef BEARSSL_SSL_BASIC
        BR_TLS_ECDHE_ECDSA_WITH_CHACHA20_POLY1305_SHA256,
        BR_TLS_ECDHE_RSA_WITH_CHACHA20_POLY1305_SHA256,
        BR_TLS_ECDHE_ECDSA_WITH_AES_128_GCM_SHA256,
        BR_TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256,
        BR_TLS_ECDHE_ECDSA_WITH_AES_256_GCM_SHA384,
        BR_TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384,
        BR_TLS_ECDHE_ECDSA_WITH_AES_128_CCM,
        BR_TLS_ECDHE_ECDSA_WITH_AES_256_CCM,
        BR_TLS_ECDHE_ECDSA_WITH_AES_128_CCM_8,
        BR_TLS_ECDHE_ECDSA_WITH_AES_256_CCM_8,
        BR_TLS_ECDHE_ECDSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_ECDHE_ECDSA_WITH_AES_256_CBC_SHA384,
        BR_TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA384,
        BR_TLS_ECDHE_ECDSA_WITH_AES_128_CBC_SHA,
        BR_TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA,
        BR_TLS_ECDHE_ECDSA_WITH_AES_256_CBC_SHA,
        BR_TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA,
        BR_TLS_ECDH_ECDSA_WITH_AES_128_GCM_SHA256,
        BR_TLS_ECDH_RSA_WITH_AES_128_GCM_SHA256,
        BR_TLS_ECDH_ECDSA_WITH_AES_256_GCM_SHA384,
        BR_TLS_ECDH_RSA_WITH_AES_256_GCM_SHA384,
        BR_TLS_ECDH_ECDSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_ECDH_RSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_ECDH_ECDSA_WITH_AES_256_CBC_SHA384,
        BR_TLS_ECDH_RSA_WITH_AES_256_CBC_SHA384,
        BR_TLS_ECDH_ECDSA_WITH_AES_128_CBC_SHA,
        BR_TLS_ECDH_RSA_WITH_AES_128_CBC_SHA,
        BR_TLS_ECDH_ECDSA_WITH_AES_256_CBC_SHA,
        BR_TLS_ECDH_RSA_WITH_AES_256_CBC_SHA,
        BR_TLS_RSA_WITH_AES_128_GCM_SHA256,
        BR_TLS_RSA_WITH_AES_256_GCM_SHA384,
        BR_TLS_RSA_WITH_AES_128_CCM,
        BR_TLS_RSA_WITH_AES_256_CCM,
        BR_TLS_RSA_WITH_AES_128_CCM_8,
        BR_TLS_RSA_WITH_AES_256_CCM_8,
#endif
        BR_TLS_RSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_RSA_WITH_AES_256_CBC_SHA256,
        BR_TLS_RSA_WITH_AES_128_CBC_SHA,
        BR_TLS_RSA_WITH_AES_256_CBC_SHA,
#ifndef BEARSSL_SSL_BASIC
        BR_TLS_ECDHE_ECDSA_WITH_3DES_EDE_CBC_SHA,
        BR_TLS_ECDHE_RSA_WITH_3DES_EDE_CBC_SHA,
        BR_TLS_ECDH_ECDSA_WITH_3DES_EDE_CBC_SHA,
        BR_TLS_ECDH_RSA_WITH_3DES_EDE_CBC_SHA,
        BR_TLS_RSA_WITH_3DES_EDE_CBC_SHA
#endif
    };
#ifndef BEARSSL_SSL_BASIC
    // Server w/EC has one set, not possible with basic SSL config
    static const uint16_t suites_server_ec_P[] PROGMEM = {
        BR_TLS_ECDHE_ECDSA_WITH_CHACHA20_POLY1305_SHA256,
        BR_TLS_ECDHE_ECDSA_WITH_AES_128_GCM_SHA256,
        BR_TLS_ECDHE_ECDSA_WITH_AES_256_GCM_SHA384,
        BR_TLS_ECDHE_ECDSA_WITH_AES_128_CCM,
        BR_TLS_ECDHE_ECDSA_WITH_AES_256_CCM,
        BR_TLS_ECDHE_ECDSA_WITH_AES_128_CCM_8,
        BR_TLS_ECDHE_ECDSA_WITH_AES_256_CCM_8,
        BR_TLS_ECDHE_ECDSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_ECDHE_ECDSA_WITH_AES_256_CBC_SHA384,
        BR_TLS_ECDHE_ECDSA_WITH_AES_128_CBC_SHA,
        BR_TLS_ECDHE_ECDSA_WITH_AES_256_CBC_SHA,
        BR_TLS_ECDH_ECDSA_WITH_AES_128_GCM_SHA256,
        BR_TLS_ECDH_RSA_WITH_AES_128_GCM_SHA256,
        BR_TLS_ECDH_ECDSA_WITH_AES_256_GCM_SHA384,
        BR_TLS_ECDH_RSA_WITH_AES_256_GCM_SHA384,
        BR_TLS_ECDH_ECDSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_ECDH_RSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_ECDH_ECDSA_WITH_AES_256_CBC_SHA384,
        BR_TLS_ECDH_RSA_WITH_AES_256_CBC_SHA384,
        BR_TLS_ECDH_ECDSA_WITH_AES_128_CBC_SHA,
        BR_TLS_ECDH_RSA_WITH_AES_128_CBC_SHA,
        BR_TLS_ECDH_ECDSA_WITH_AES_256_CBC_SHA,
        BR_TLS_ECDH_RSA_WITH_AES_256_CBC_SHA,
        BR_TLS_ECDHE_ECDSA_WITH_3DES_EDE_CBC_SHA,
        BR_TLS_ECDH_ECDSA_WITH_3DES_EDE_CBC_SHA,
        BR_TLS_ECDH_RSA_WITH_3DES_EDE_CBC_SHA};
#endif

    static const uint16_t suites_server_rsa_P[] PROGMEM = {
#ifndef BEARSSL_SSL_BASIC
        BR_TLS_ECDHE_RSA_WITH_CHACHA20_POLY1305_SHA256,
        BR_TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256,
        BR_TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384,
        BR_TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA384,
        BR_TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA,
        BR_TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA,
        BR_TLS_RSA_WITH_AES_128_GCM_SHA256,
        BR_TLS_RSA_WITH_AES_256_GCM_SHA384,
        BR_TLS_RSA_WITH_AES_128_CCM,
        BR_TLS_RSA_WITH_AES_256_CCM,
        BR_TLS_RSA_WITH_AES_128_CCM_8,
        BR_TLS_RSA_WITH_AES_256_CCM_8,
#endif
        BR_TLS_RSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_RSA_WITH_AES_256_CBC_SHA256,
        BR_TLS_RSA_WITH_AES_128_CBC_SHA,
        BR_TLS_RSA_WITH_AES_256_CBC_SHA,
#ifndef BEARSSL_SSL_BASIC
        BR_TLS_ECDHE_RSA_WITH_3DES_EDE_CBC_SHA,
        BR_TLS_RSA_WITH_3DES_EDE_CBC_SHA
#endif
    };

    // For apps which want to use less secure but faster ciphers, only
    static const uint16_t faster_suites_P[] PROGMEM = {
        BR_TLS_RSA_WITH_AES_256_CBC_SHA256,
        BR_TLS_RSA_WITH_AES_128_CBC_SHA256,
        BR_TLS_RSA_WITH_AES_256_CBC_SHA,
        BR_TLS_RSA_WITH_AES_128_CBC_SHA};

    // Install hashes into the SSL engine
    static void br_ssl_client_install_hashes(br_ssl_engine_context *eng)
    {
      br_ssl_engine_set_hash(eng, br_md5_ID, &br_md5_vtable);
      br_ssl_engine_set_hash(eng, br_sha1_ID, &br_sha1_vtable);
      br_ssl_engine_set_hash(eng, br_sha224_ID, &br_sha224_vtable);
      br_ssl_engine_set_hash(eng, br_sha256_ID, &br_sha256_vtable);
      br_ssl_engine_set_hash(eng, br_sha384_ID, &br_sha384_vtable);
      br_ssl_engine_set_hash(eng, br_sha512_ID, &br_sha512_vtable);
    }

