arendst/Tasmota/lib/libesp32/lib_mail/src/wcs/esp8266/ESP_Mail_WCS.cpp
    static void br_x509_minimal_install_hashes(br_x509_minimal_context *x509)
    {
      br_x509_minimal_set_hash(x509, br_md5_ID, &br_md5_vtable);
      br_x509_minimal_set_hash(x509, br_sha1_ID, &br_sha1_vtable);
      br_x509_minimal_set_hash(x509, br_sha224_ID, &br_sha224_vtable);
      br_x509_minimal_set_hash(x509, br_sha256_ID, &br_sha256_vtable);
      br_x509_minimal_set_hash(x509, br_sha384_ID, &br_sha384_vtable);
      br_x509_minimal_set_hash(x509, br_sha512_ID, &br_sha512_vtable);
    }

    // Default initializion for our SSL clients
    static void br_ssl_client_base_init(br_ssl_client_context *cc, const uint16_t *cipher_list, int cipher_cnt)
    {
      uint16_t suites[cipher_cnt];
      memcpy_P(suites, cipher_list, cipher_cnt * sizeof(cipher_list[0]));
      br_ssl_client_zero(cc);
      br_ssl_engine_add_flags(&cc->eng, BR_OPT_NO_RENEGOTIATION); // forbid SSL renegociation, as we free the Private Key after handshake
      br_ssl_engine_set_versions(&cc->eng, BR_TLS10, BR_TLS12);
      br_ssl_engine_set_suites(&cc->eng, suites, (sizeof suites) / (sizeof suites[0]));
      br_ssl_client_set_default_rsapub(cc);
      br_ssl_engine_set_default_rsavrfy(&cc->eng);
#ifndef BEARSSL_SSL_BASIC
      br_ssl_engine_set_default_ecdsa(&cc->eng);
#endif
      br_ssl_client_install_hashes(&cc->eng);
      br_ssl_engine_set_prf10(&cc->eng, &br_tls10_prf);
      br_ssl_engine_set_prf_sha256(&cc->eng, &br_tls12_sha256_prf);
      br_ssl_engine_set_prf_sha384(&cc->eng, &br_tls12_sha384_prf);
      br_ssl_engine_set_default_aes_cbc(&cc->eng);
#ifndef BEARSSL_SSL_BASIC
      br_ssl_engine_set_default_aes_gcm(&cc->eng);
      br_ssl_engine_set_default_aes_ccm(&cc->eng);
      br_ssl_engine_set_default_des_cbc(&cc->eng);
      br_ssl_engine_set_default_chapol(&cc->eng);
#endif
    }

    // Default initializion for our SSL clients
    static void br_ssl_server_base_init(br_ssl_server_context *cc, const uint16_t *cipher_list, int cipher_cnt)
    {
      uint16_t suites[cipher_cnt];
      memcpy_P(suites, cipher_list, cipher_cnt * sizeof(cipher_list[0]));
      br_ssl_server_zero(cc);
      br_ssl_engine_add_flags(&cc->eng, BR_OPT_NO_RENEGOTIATION); // forbid SSL renegociation, as we free the Private Key after handshake
      br_ssl_engine_set_versions(&cc->eng, BR_TLS10, BR_TLS12);
      br_ssl_engine_set_suites(&cc->eng, suites, (sizeof suites) / (sizeof suites[0]));
#ifndef BEARSSL_SSL_BASIC
      br_ssl_engine_set_default_ec(&cc->eng);
#endif

      br_ssl_client_install_hashes(&cc->eng);
      br_ssl_engine_set_prf10(&cc->eng, &br_tls10_prf);
      br_ssl_engine_set_prf_sha256(&cc->eng, &br_tls12_sha256_prf);
      br_ssl_engine_set_prf_sha384(&cc->eng, &br_tls12_sha384_prf);
      br_ssl_engine_set_default_aes_cbc(&cc->eng);
#ifndef BEARSSL_SSL_BASIC
      br_ssl_engine_set_default_aes_ccm(&cc->eng);
      br_ssl_engine_set_default_aes_gcm(&cc->eng);
      br_ssl_engine_set_default_des_cbc(&cc->eng);
      br_ssl_engine_set_default_chapol(&cc->eng);
#endif
    }
  }

  // Set custom list of ciphers
  bool ESP_Mail_WCS::setCiphers(const uint16_t *cipherAry, int cipherCount)
  {
    _cipher_list = nullptr;
    _cipher_list = std::shared_ptr<uint16_t>(new uint16_t[cipherCount], std::default_delete<uint16_t[]>());
    if (!_cipher_list.get())
    {
      DEBUG_BSSL("setCiphers: list empty\n");
      return false;
    }
    memcpy_P(_cipher_list.get(), cipherAry, cipherCount * sizeof(uint16_t));
    _cipher_cnt = cipherCount;
    return true;
  }

  bool ESP_Mail_WCS::setCiphersLessSecure()
  {
    return setCiphers(faster_suites_P, sizeof(faster_suites_P) / sizeof(faster_suites_P[0]));
  }

  bool ESP_Mail_WCS::setCiphers(std::vector<uint16_t> list)
  {
    return setCiphers(&list[0], list.size());
  }

  // Installs the appropriate X509 cert validation method for a client connection
  bool ESP_Mail_WCS::_installClientX509Validator()
  {
    if (_use_insecure || _use_fingerprint || _use_self_signed)
    {
      // Use common insecure x509 authenticator
      _x509_insecure = std::make_shared<struct br_x509_insecure_context>();
      if (!_x509_insecure)
      {
        DEBUG_BSSL("_installClientX509Validator: OOM for _x509_insecure\n");
        return false;
      }
      esp_mail_br_x509_insecure_init(_x509_insecure.get(), _use_fingerprint, _fingerprint, _use_self_signed);
      br_ssl_engine_set_x509(_eng, &_x509_insecure->vtable);
    }
    else if (_knownkey)
    {
      // Simple, pre-known public key authenticator, ignores cert completely.
      _x509_knownkey = std::make_shared<br_x509_knownkey_context>();
      if (!_x509_knownkey)
      {
        DEBUG_BSSL("_installClientX509Validator: OOM for _x509_knownkey\n");
        return false;
      }
      if (_knownkey->isRSA())
      {
        br_x509_knownkey_init_rsa(_x509_knownkey.get(), _knownkey->getRSA(), _knownkey_usages);
      }
      else if (_knownkey->isEC())
      {
#ifndef BEARSSL_SSL_BASIC
        br_x509_knownkey_init_ec(_x509_knownkey.get(), _knownkey->getEC(), _knownkey_usages);
#else
        (void)_knownkey;
        (void)_knownkey_usages;
        DEBUG_BSSL("_installClientX509Validator: Attempting to use EC keys in minimal cipher mode (no EC)\n");
        return false;
#endif
      }
      br_ssl_engine_set_x509(_eng, &_x509_knownkey->vtable);
    }
    else
    {
      // X509 minimal validator.  Checks dates, cert chain for trusted CA, etc.
      _x509_minimal = std::make_shared<br_x509_minimal_context>();
      if (!_x509_minimal)
      {
        DEBUG_BSSL("_installClientX509Validator: OOM for _x509_minimal\n");
        return false;
      }
      br_x509_minimal_init(_x509_minimal.get(), &br_sha256_vtable, _ta ? _ta->getTrustAnchors() : nullptr, _ta ? _ta->getCount() : 0);
      br_x509_minimal_set_rsa(_x509_minimal.get(), br_ssl_engine_get_rsavrfy(_eng));
#ifndef BEARSSL_SSL_BASIC
      br_x509_minimal_set_ecdsa(_x509_minimal.get(), br_ssl_engine_get_ec(_eng), br_ssl_engine_get_ecdsa(_eng));
#endif
      br_x509_minimal_install_hashes(_x509_minimal.get());
      if (_now)
      {
        // Magic constants convert to x509 times
        br_x509_minimal_set_time(_x509_minimal.get(), ((uint32_t)_now) / 86400 + 719528, ((uint32_t)_now) % 86400);
      }
      if (_certStore)
      {
        _certStore->installCertStore(_x509_minimal.get());
      }
      br_ssl_engine_set_x509(_eng, &_x509_minimal->vtable);
    }
    return true;
  }

  // Called by connect() to do the actual SSL setup and handshake.
  // Returns if the SSL handshake succeeded.
  bool ESP_Mail_WCS::_connectSSL(const char *hostName)
  {
    DEBUG_BSSL("_connectSSL: start connection\n");
    _freeSSL();
    _oom_err = false;

#ifdef DEBUG_ESP_SSL
    // BearSSL will reject all connections unless an authentication option is set, warn in DEBUG builds
    if (!_use_insecure && !_use_fingerprint && !_use_self_signed && !_knownkey && !_certStore && !_ta)
    {
      DEBUG_BSSL("Connection *will* fail, no authentication method is setup\n");
    }
#endif

    _sc = std::make_shared<br_ssl_client_context>();
    _eng = &_sc->eng; // Allocation/deallocation taken care of by the _sc shared_ptr
    _iobuf_in = std::shared_ptr<unsigned char>(new unsigned char[_iobuf_in_size], std::default_delete<unsigned char[]>());
    _iobuf_out = std::shared_ptr<unsigned char>(new unsigned char[_iobuf_out_size], std::default_delete<unsigned char[]>());

    if (!_sc || !_iobuf_in || !_iobuf_out)
    {
      _freeSSL(); // Frees _sc, _iobuf*
      _oom_err = true;
      DEBUG_BSSL("_connectSSL: OOM error\n");
      return false;
    }

    // If no cipher list yet set, use defaults
    if (_cipher_list.get() == nullptr)
    {
      br_ssl_client_base_init(_sc.get(), suites_P, sizeof(suites_P) / sizeof(suites_P[0]));
    }
    else
    {
      br_ssl_client_base_init(_sc.get(), _cipher_list.get(), _cipher_cnt);
    }
    // Only failure possible in the installation is OOM
    if (!_installClientX509Validator())
    {
      _freeSSL();
      _oom_err = true;
      DEBUG_BSSL("_connectSSL: Can't install x509 validator\n");
      return false;
    }
    br_ssl_engine_set_buffers_bidi(_eng, _iobuf_in.get(), _iobuf_in_size, _iobuf_out.get(), _iobuf_out_size);

    // Apply any client certificates, if supplied.
    if (_sk && _sk->isRSA())
    {
      br_ssl_client_set_single_rsa(_sc.get(), _chain ? _chain->getX509Certs() : nullptr, _chain ? _chain->getCount() : 0,
                                   _sk->getRSA(), br_rsa_pkcs1_sign_get_default());
    }
    else if (_sk && _sk->isEC())
    {
#ifndef BEARSSL_SSL_BASIC
      br_ssl_client_set_single_ec(_sc.get(), _chain ? _chain->getX509Certs() : nullptr, _chain ? _chain->getCount() : 0,
                                  _sk->getEC(), _allowed_usages,
                                  _cert_issuer_key_type, br_ec_get_default(), br_ecdsa_sign_asn1_get_default());
#else
      _freeSSL();
      DEBUG_BSSL("_connectSSL: Attempting to use EC cert in minimal cipher mode (no EC)\n");
      return false;
#endif
    }

    // Restore session from the storage spot, if present
    if (_session)
    {
      br_ssl_engine_set_session_parameters(_eng, _session->getSession());
    }

    if (!br_ssl_client_reset(_sc.get(), hostName, _session ? 1 : 0))
    {
      _freeSSL();
      DEBUG_BSSL("_connectSSL: Can't reset client\n");
      return false;
    }

    auto ret = _wait_for_handshake();
#ifdef DEBUG_ESP_SSL
    if (!ret)
    {
      char err[256];
      getLastSSLError(err, sizeof(err));
      DEBUG_BSSL("Couldn't connect. Error = '%s'\n", err);
    }
    else
    {
      DEBUG_BSSL("Connected!\n");
    }
#endif

    // Session is already validated here, there is no need to keep following
    _x509_minimal = nullptr;
    _x509_insecure = nullptr;
    _x509_knownkey = nullptr;

