arendst/Tasmota/lib/libesp32/lib_mail/src/wcs/esp8266/ESP_Mail_WCS.cpp
    // reduce timeout after successful handshake to fail fast if server stop accepting our data for whathever reason
    if (ret)
      _timeout = 5000;

    return ret;
  }

  // Slightly different X509 setup for servers who want to validate client
  // certificates, so factor it out as it's used in RSA and EC servers.
  bool ESP_Mail_WCS::_installServerX509Validator(const ESP_Mail_X509List *client_CA_ta)
  {
    if (client_CA_ta)
    {
      _ta = client_CA_ta;
      // X509 minimal validator.  Checks dates, cert chain for trusted CA, etc.
      _x509_minimal = std::make_shared<br_x509_minimal_context>();
      if (!_x509_minimal)
      {
        _freeSSL();
        _oom_err = true;
        DEBUG_BSSL("_installServerX509Validator: OOM for _x509_minimal\n");
        return false;
      }
      br_x509_minimal_init(_x509_minimal.get(), &br_sha256_vtable, _ta->getTrustAnchors(), _ta->getCount());
      br_ssl_engine_set_default_rsavrfy(_eng);
#ifndef BEARSSL_SSL_BASIC
      br_ssl_engine_set_default_ecdsa(_eng);
#endif
      br_x509_minimal_set_rsa(_x509_minimal.get(), br_ssl_engine_get_rsavrfy(_eng));
#ifndef BEARSSL_SSL_BASIC
      br_x509_minimal_set_ecdsa(_x509_minimal.get(), br_ssl_engine_get_ec(_eng), br_ssl_engine_get_ecdsa(_eng));
#endif
      br_x509_minimal_install_hashes(_x509_minimal.get());
      if (_now)
      {
        // Magic constants convert to x509 times
        br_x509_minimal_set_time(_x509_minimal.get(), ((uint32_t)_now) / 86400 + 719528, ((uint32_t)_now) % 86400);
      }
      br_ssl_engine_set_x509(_eng, &_x509_minimal->vtable);
      br_ssl_server_set_trust_anchor_names_alt(_sc_svr.get(), _ta->getTrustAnchors(), _ta->getCount());
    }
    return true;
  }

  // Called by WiFiServerBearSSL when an RSA cert/key is specified.
  bool ESP_Mail_WCS::_connectSSLServerRSA(const ESP_Mail_X509List *chain,
                                          const PrivateKey *sk,
                                          const ESP_Mail_X509List *client_CA_ta)
  {
    _freeSSL();
    _oom_err = false;
    _sc_svr = std::make_shared<br_ssl_server_context>();
    _eng = &_sc_svr->eng; // Allocation/deallocation taken care of by the _sc shared_ptr
    _iobuf_in = std::shared_ptr<unsigned char>(new unsigned char[_iobuf_in_size], std::default_delete<unsigned char[]>());
    _iobuf_out = std::shared_ptr<unsigned char>(new unsigned char[_iobuf_out_size], std::default_delete<unsigned char[]>());

    if (!_sc_svr || !_iobuf_in || !_iobuf_out)
    {
      _freeSSL();
      _oom_err = true;
      DEBUG_BSSL("_connectSSLServerRSA: OOM error\n");
      return false;
    }

    br_ssl_server_base_init(_sc_svr.get(), suites_server_rsa_P, sizeof(suites_server_rsa_P) / sizeof(suites_server_rsa_P[0]));
    br_ssl_server_set_single_rsa(_sc_svr.get(), chain ? chain->getX509Certs() : nullptr, chain ? chain->getCount() : 0,
                                 sk ? sk->getRSA() : nullptr, BR_KEYTYPE_KEYX | BR_KEYTYPE_SIGN,
                                 br_rsa_private_get_default(), br_rsa_pkcs1_sign_get_default());
    br_ssl_engine_set_buffers_bidi(_eng, _iobuf_in.get(), _iobuf_in_size, _iobuf_out.get(), _iobuf_out_size);
    if (client_CA_ta && !_installServerX509Validator(client_CA_ta))
    {
      DEBUG_BSSL("_connectSSLServerRSA: Can't install serverX509check\n");
      return false;
    }
    if (!br_ssl_server_reset(_sc_svr.get()))
    {
      _freeSSL();
      DEBUG_BSSL("_connectSSLServerRSA: Can't reset server ctx\n");
      return false;
    }

    return _wait_for_handshake();
  }

  // Called by WiFiServerBearSSL when an elliptic curve cert/key is specified.
  bool ESP_Mail_WCS::_connectSSLServerEC(const ESP_Mail_X509List *chain,
                                         unsigned cert_issuer_key_type, const PrivateKey *sk,
                                         const ESP_Mail_X509List *client_CA_ta)
  {
#ifndef BEARSSL_SSL_BASIC
    _freeSSL();
    _oom_err = false;
    _sc_svr = std::make_shared<br_ssl_server_context>();
    _eng = &_sc_svr->eng; // Allocation/deallocation taken care of by the _sc shared_ptr
    _iobuf_in = std::shared_ptr<unsigned char>(new unsigned char[_iobuf_in_size], std::default_delete<unsigned char[]>());
    _iobuf_out = std::shared_ptr<unsigned char>(new unsigned char[_iobuf_out_size], std::default_delete<unsigned char[]>());

    if (!_sc_svr || !_iobuf_in || !_iobuf_out)
    {
      _freeSSL();
      _oom_err = true;
      DEBUG_BSSL("_connectSSLServerEC: OOM error\n");
      return false;
    }

    br_ssl_server_base_init(_sc_svr.get(), suites_server_ec_P, sizeof(suites_server_ec_P) / sizeof(suites_server_ec_P[0]));
    br_ssl_server_set_single_ec(_sc_svr.get(), chain ? chain->getX509Certs() : nullptr, chain ? chain->getCount() : 0,
                                sk ? sk->getEC() : nullptr, BR_KEYTYPE_KEYX | BR_KEYTYPE_SIGN,
                                cert_issuer_key_type, br_ssl_engine_get_ec(_eng), br_ecdsa_i15_sign_asn1);
    br_ssl_engine_set_buffers_bidi(_eng, _iobuf_in.get(), _iobuf_in_size, _iobuf_out.get(), _iobuf_out_size);
    if (client_CA_ta && !_installServerX509Validator(client_CA_ta))
    {
      DEBUG_BSSL("_connectSSLServerEC: Can't install serverX509check\n");
      return false;
    }
    if (!br_ssl_server_reset(_sc_svr.get()))
    {
      _freeSSL();
      DEBUG_BSSL("_connectSSLServerEC: Can't reset server ctx\n");
      return false;
    }

    return _wait_for_handshake();
#else
    (void)chain;
    (void)cert_issuer_key_type;
    (void)sk;
    (void)client_CA_ta;
    DEBUG_BSSL("_connectSSLServerEC: Attempting to use EC cert in minimal cipher mode (no EC)\n");
    return false;
#endif
  }

  // Returns an error ID and possibly a string (if dest != null) of the last
  // BearSSL reported error.
  int ESP_Mail_WCS::getLastSSLError(char *dest, size_t len)
  {
    int err = 0;
    const char *t = PSTR("OK");
    if (_sc || _sc_svr)
    {
      err = br_ssl_engine_last_error(_eng);
    }
    if (_oom_err)
    {
      err = -1000;
    }
    switch (err)
    {
    case -1000:
      t = PSTR("Unable to allocate memory for SSL structures and buffers.");
      break;
    case BR_ERR_BAD_PARAM:
      t = PSTR("Caller-provided parameter is incorrect.");
      break;
    case BR_ERR_BAD_STATE:
      t = PSTR("Operation requested by the caller cannot be applied with the current context state (e.g. reading data while outgoing data is waiting to be sent).");
      break;
    case BR_ERR_UNSUPPORTED_VERSION:
      t = PSTR("Incoming protocol or record version is unsupported.");
      break;
    case BR_ERR_BAD_VERSION:
      t = PSTR("Incoming record version does not match the expected version.");
      break;
    case BR_ERR_BAD_LENGTH:
      t = PSTR("Incoming record length is invalid.");
      break;
    case BR_ERR_TOO_LARGE:
      t = PSTR("Incoming record is too large to be processed, or buffer is too small for the handshake message to send.");
      break;
    case BR_ERR_BAD_MAC:
      t = PSTR("Decryption found an invalid padding, or the record MAC is not correct.");
      break;
    case BR_ERR_NO_RANDOM:
      t = PSTR("No initial entropy was provided, and none can be obtained from the OS.");
      break;
    case BR_ERR_UNKNOWN_TYPE:
      t = PSTR("Incoming record type is unknown.");
      break;
    case BR_ERR_UNEXPECTED:
      t = PSTR("Incoming record or message has wrong type with regards to the current engine state.");
      break;
    case BR_ERR_BAD_CCS:
      t = PSTR("ChangeCipherSpec message from the peer has invalid contents.");
      break;
    case BR_ERR_BAD_ALERT:
      t = PSTR("Alert message from the peer has invalid contents (odd length).");
      break;
    case BR_ERR_BAD_HANDSHAKE:
      t = PSTR("Incoming handshake message decoding failed.");
      break;
    case BR_ERR_OVERSIZED_ID:
      t = PSTR("ServerHello contains a session ID which is larger than 32 bytes.");
      break;
    case BR_ERR_BAD_CIPHER_SUITE:
      t = PSTR("Server wants to use a cipher suite that we did not claim to support. This is also reported if we tried to advertise a cipher suite that we do not support.");
      break;
    case BR_ERR_BAD_COMPRESSION:
      t = PSTR("Server wants to use a compression that we did not claim to support.");
      break;
    case BR_ERR_BAD_FRAGLEN:
      t = PSTR("Server's max fragment length does not match client's.");
      break;
    case BR_ERR_BAD_SECRENEG:
      t = PSTR("Secure renegotiation failed.");
      break;
    case BR_ERR_EXTRA_EXTENSION:
      t = PSTR("Server sent an extension type that we did not announce, or used the same extension type several times in a single ServerHello.");
      break;
    case BR_ERR_BAD_SNI:
      t = PSTR("Invalid Server Name Indication contents (when used by the server, this extension shall be empty).");
      break;
    case BR_ERR_BAD_HELLO_DONE:
      t = PSTR("Invalid ServerHelloDone from the server (length is not 0).");
      break;
    case BR_ERR_LIMIT_EXCEEDED:
      t = PSTR("Internal limit exceeded (e.g. server's public key is too large).");
      break;
    case BR_ERR_BAD_FINISHED:
      t = PSTR("Finished message from peer does not match the expected value.");
      break;
    case BR_ERR_RESUME_MISMATCH:
      t = PSTR("Session resumption attempt with distinct version or cipher suite.");
      break;
    case BR_ERR_INVALID_ALGORITHM:
      t = PSTR("Unsupported or invalid algorithm (ECDHE curve, signature algorithm, hash function).");
      break;
    case BR_ERR_BAD_SIGNATURE:
      t = PSTR("Invalid signature in ServerKeyExchange or CertificateVerify message.");
      break;
    case BR_ERR_WRONG_KEY_USAGE:
      t = PSTR("Peer's public key does not have the proper type or is not allowed for the requested operation.");
      break;
    case BR_ERR_NO_CLIENT_AUTH:
      t = PSTR("Client did not send a certificate upon request, or the client certificate could not be validated.");
      break;
    case BR_ERR_IO:
      t = PSTR("I/O error or premature close on transport stream.");
      break;
    case BR_ERR_X509_INVALID_VALUE:
      t = PSTR("Invalid value in an ASN.1 structure.");
      break;
    case BR_ERR_X509_TRUNCATED:
      t = PSTR("Truncated certificate or other ASN.1 object.");
      break;
    case BR_ERR_X509_EMPTY_CHAIN:
      t = PSTR("Empty certificate chain (no certificate at all).");
      break;
    case BR_ERR_X509_INNER_TRUNC:
      t = PSTR("Decoding error: inner element extends beyond outer element size.");
      break;
    case BR_ERR_X509_BAD_TAG_CLASS:
      t = PSTR("Decoding error: unsupported tag class (application or private).");
      break;
    case BR_ERR_X509_BAD_TAG_VALUE:
      t = PSTR("Decoding error: unsupported tag value.");
      break;
    case BR_ERR_X509_INDEFINITE_LENGTH:
      t = PSTR("Decoding error: indefinite length.");
      break;
    case BR_ERR_X509_EXTRA_ELEMENT:
      t = PSTR("Decoding error: extraneous element.");
      break;
    case BR_ERR_X509_UNEXPECTED:
      t = PSTR("Decoding error: unexpected element.");
      break;
    case BR_ERR_X509_NOT_CONSTRUCTED:
      t = PSTR("Decoding error: expected constructed element, but is primitive.");
      break;
    case BR_ERR_X509_NOT_PRIMITIVE:
      t = PSTR("Decoding error: expected primitive element, but is constructed.");
      break;
    case BR_ERR_X509_PARTIAL_BYTE:
      t = PSTR("Decoding error: BIT STRING length is not multiple of 8.");
      break;
    case BR_ERR_X509_BAD_BOOLEAN:
      t = PSTR("Decoding error: BOOLEAN value has invalid length.");
      break;
    case BR_ERR_X509_OVERFLOW:
      t = PSTR("Decoding error: value is off-limits.");
      break;
    case BR_ERR_X509_BAD_DN:
      t = PSTR("Invalid distinguished name.");
      break;
    case BR_ERR_X509_BAD_TIME:
      t = PSTR("Invalid date/time representation.");
      break;
    case BR_ERR_X509_UNSUPPORTED:
      t = PSTR("Certificate contains unsupported features that cannot be ignored.");
      break;
    case BR_ERR_X509_LIMIT_EXCEEDED:
      t = PSTR("Key or signature size exceeds internal limits.");
      break;
    case BR_ERR_X509_WRONG_KEY_TYPE:
      t = PSTR("Key type does not match that which was expected.");
      break;
    case BR_ERR_X509_BAD_SIGNATURE:
      t = PSTR("Signature is invalid.");
      break;
    case BR_ERR_X509_TIME_UNKNOWN:
      t = PSTR("Validation time is unknown.");
      break;
    case BR_ERR_X509_EXPIRED:
      t = PSTR("Certificate is expired or not yet valid.");
      break;
    case BR_ERR_X509_DN_MISMATCH:
      t = PSTR("Issuer/Subject DN mismatch in the chain.");
      break;
    case BR_ERR_X509_BAD_SERVER_NAME:
      t = PSTR("Expected server name was not found in the chain.");
      break;
    case BR_ERR_X509_CRITICAL_EXTENSION:
      t = PSTR("Unknown critical extension in certificate.");
      break;
    case BR_ERR_X509_NOT_CA:
      t = PSTR("Not a CA, or path length constraint violation.");
      break;
    case BR_ERR_X509_FORBIDDEN_KEY_USAGE:
      t = PSTR("Key Usage extension prohibits intended usage.");
      break;
    case BR_ERR_X509_WEAK_PUBLIC_KEY:
      t = PSTR("Public key found in certificate is too small.");
      break;
    case BR_ERR_X509_NOT_TRUSTED:
      t = PSTR("Chain could not be linked to a trust anchor.");
      break;
    default:
      t = PSTR("Unknown error code.");
      break;
    }
    if (dest)
    {
      strncpy_P(dest, t, len);
      dest[len - 1] = 0;
    }
    return err;
  }

  bool ESP_Mail_WCS::probeMaxFragmentLength(const char *name, uint16_t port, uint16_t len)
  {
    IPAddress remote_addr;
    if (!WiFi.hostByName(name, remote_addr))
    {
      DEBUG_BSSL("probeMaxFragmentLength: Can't resolve host\n");
      return false;
    }
    return ESP_Mail_WCS::probeMaxFragmentLength(remote_addr, port, len);
  }

  bool ESP_Mail_WCS::probeMaxFragmentLength(const String &host, uint16_t port, uint16_t len)
  {
    return ESP_Mail_WCS::probeMaxFragmentLength(host.c_str(), port, len);
  }

