arendst/Tasmota/lib/libesp32/lib_mail/src/wcs/esp8266/ESP_Mail_WCS.cpp
    ret = probe.readBytes(extBytes, 2);
    handLen -= ret;
    extLen = extBytes[1] | (extBytes[0] << 8);
    if ((extLen == 0) || (ret != 2))
    {
      return _SendAbort(probe, supportsLen);
    }

    while (handLen > 0)
    {
      // Parse each extension and look for MFLN
      uint8_t typeBytes[2];
      ret = probe.readBytes(typeBytes, 2);
      handLen -= 2;
      if ((ret != 2) || (handLen <= 0))
      {
        return _SendAbort(probe, supportsLen);
      }
      uint8_t lenBytes[2];
      ret = probe.readBytes(lenBytes, 2);
      handLen -= 2;
      uint16_t extLen = lenBytes[1] | (lenBytes[0] << 8);
      if ((ret != 2) || (handLen <= 0) || (extLen > 32) || (extLen > handLen))
      {
        return _SendAbort(probe, supportsLen);
      }
      if ((typeBytes[0] == 0x00) && (typeBytes[1] == 0x01))
      { // MFLN extension!
        // If present and 1-byte in length, it's supported
        return _SendAbort(probe, extLen == 1 ? true : false);
      }
      // Skip the extension, move to next one
      uint8_t junk[32];
      ret = probe.readBytes(junk, extLen);
      handLen -= extLen;
      if (ret != extLen)
      {
        return _SendAbort(probe, supportsLen);
      }
    }
    return _SendAbort(probe, supportsLen);
  }

  // AXTLS compatibility interfaces
  bool ESP_Mail_WCS::setCACert(const uint8_t *pk, size_t size)
  {
    _axtls_ta = nullptr;
    _axtls_ta = std::shared_ptr<ESP_Mail_X509List>(new ESP_Mail_X509List(pk, size));
    _ta = _axtls_ta.get();
    return _ta ? true : false;
  }

  bool ESP_Mail_WCS::setCertificate(const uint8_t *pk, size_t size)
  {
    _axtls_chain = nullptr;
    _axtls_chain = std::shared_ptr<ESP_Mail_X509List>(new ESP_Mail_X509List(pk, size));
    _chain = _axtls_chain.get();
    return _chain ? true : false;
  }

  bool ESP_Mail_WCS::setPrivateKey(const uint8_t *pk, size_t size)
  {
    _axtls_sk = nullptr;
    _axtls_sk = std::shared_ptr<PrivateKey>(new PrivateKey(pk, size));
    _sk = _axtls_sk.get();
    return _sk ? true : false;
  }

  uint8_t *ESP_Mail_WCS::_streamLoad(Stream &stream, size_t size)
  {
    uint8_t *dest = (uint8_t *)malloc(size);
    if (!dest)
    {
      return nullptr;
    }
    if (size != stream.readBytes(dest, size))
    {
      free(dest);
      return nullptr;
    }
    return dest;
  }

  bool ESP_Mail_WCS::loadCACert(Stream &stream, size_t size)
  {
    uint8_t *dest = _streamLoad(stream, size);
    bool ret = false;
    if (dest)
    {
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wdeprecated-declarations"
      ret = setCACert(dest, size);
#pragma GCC diagnostic pop
    }
    free(dest);
    return ret;
  }

  bool ESP_Mail_WCS::loadCertificate(Stream &stream, size_t size)
  {
    uint8_t *dest = _streamLoad(stream, size);
    bool ret = false;
    if (dest)
    {
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wdeprecated-declarations"
      ret = setCertificate(dest, size);
#pragma GCC diagnostic pop
    }
    free(dest);
    return ret;
  }

  bool ESP_Mail_WCS::loadPrivateKey(Stream &stream, size_t size)
  {
    uint8_t *dest = _streamLoad(stream, size);
    bool ret = false;
    if (dest)
    {
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wdeprecated-declarations"
      ret = setPrivateKey(dest, size);
#pragma GCC diagnostic pop
    }
    free(dest);
    return ret;
  }

  void ESP_Mail_WCS::setStartTLS(bool enable)
  {
    _secured = !enable;
  }

  size_t ESP_Mail_WCS::_ns_write(uint8_t b)
  {
    return write(&b, 1);
  }

  size_t ESP_Mail_WCS::_ns_write(const uint8_t *buf, size_t size)
  {
    if (!_client || !size)
    {
      return 0;
    }
    _client->setTimeout(_timeout);
#if defined(ESP8266_CORE_SDK_V3_X_X)
    return _client->write((const char *)buf, size);
#else
    return _client->write(buf, size);
#endif
  }

  size_t ESP_Mail_WCS::_ns_write(Stream &stream, size_t unused)
  {
    (void)unused;
    return WiFiClient::write(stream);
  }

  size_t ESP_Mail_WCS::_ns_write(Stream &stream)
  {
    if (!_client || !stream.available())
    {
      return 0;
    }
    _client->setTimeout(_timeout);
#if defined(ESP8266_CORE_SDK_V3_X_X)
    size_t dl = stream.available();
    uint8_t buf[dl];
    stream.readBytes(buf, dl);
    return _client->write((const char *)buf, dl);
#else
    return _client->write(stream);
#endif
  }

  size_t ESP_Mail_WCS::_ns_write_P(PGM_P buf, size_t size)
  {

    if (!_client || !size)
    {
      return 0;
    }
    _client->setTimeout(_timeout);

#if defined(ESP8266_CORE_SDK_V3_X_X)
    char dest[size];
    memcpy_P((void *)dest, (PGM_VOID_P)buf, size);
    return _client->write((const char *)dest, size);
#else
    return _client->write_P(buf, size);
#endif
  }

  int ESP_Mail_WCS::_ns_available()
  {
    if (!_client)
      return false;

    int result = _client->getSize();

    if (!result)
    {
      optimistic_yield(100);
    }
    return result;
  }

  int ESP_Mail_WCS::_ns_read()
  {
    if (!_ns_available())
      return -1;

    return _client->read();
  }

  int ESP_Mail_WCS::_ns_read(uint8_t *buf, size_t size)
  {
    return (int)_client->read(reinterpret_cast<char *>(buf), size);
  }

  int ESP_Mail_WCS::_ns_peek()
  {
    if (!_ns_available())
      return -1;

    return _client->peek();
  }

  size_t ESP_Mail_WCS::_ns_peekBytes(uint8_t *buffer, size_t length)
  {
    size_t count = 0;

    if (!_client)
    {
      return 0;
    }

    _startMillis = millis();
    while ((_ns_available() < (int)length) && ((millis() - _startMillis) < _timeout))
    {
      yield();
    }

    if (_ns_available() < (int)length)
    {
      count = _ns_available();
    }
    else
    {
      count = length;
    }

    return _client->peekBytes((char *)buffer, count);
  }

  uint8_t ESP_Mail_WCS::_ns_connected()
  {
    if (!_client || _client->state() == CLOSED)
      return 0;

    return _client->state() == ESTABLISHED || _ns_available();
  }

  bool ESP_Mail_WCS::_ns_connect_ssl()
  {
    return _connectSSL(_host_name.c_str());
  }
}; // namespace ESP_Mail

#endif /* ESP8266 */

#endif /* ESP_Mail_WCS_CPP */